#include <iostream>
#include <algorithm>
using namespace std;

int n;

int main() {
    
    cin.sync_with_stdio(0);
    cin.tie(0);
    cin >> n;
    if(n%7==1 || n%7==3) cout << "CY";
    else cout << "SK";
    
    return 0;
}
/*  1/3/4개, 마지막 돌 가져가면 패배
1 : 상근 -> 창영win
2 : 상근(1)>창영(1) -> 상근 win
3 : 상근(1)>창영(1)>상근(1) -> 창영 win
4 : 상근(3)>창영(1) -> 상근 win
5 : 상근(4)>창영(1) -> 상근 win
6 : 상근(3)>창영(1)>상근(1)>창영(1) -> 상근 win (3개남으면 그때 시작하는 사람이 필패)
7 : 상근(4)>창영(1)>상근(1)>창영(1) -> 상근 win (즉, 6, 7때 선공권있으면 이김)
8 : 상근(1)>창영(4)>상근(1)>창영(1)>상근(1) -> 창영 win
9 : 상근(1)>위와똑같이 > 상근 win
10 : 창영, 11:상근, 12:상근, 13:상근, 14:상근, 15:창영, 16:상근, 17:창영

*/